#+TITLE: Build and run the set of applications

**** Smoke test

- Create a task

#+BEGIN_SRC sh :results output
while true; do 
  curl -X POST 127.0.0.1:8080/createTask; sleep 0.1
done
#+END_SRC

#+RESULTS:
: Task scheduled in 1.299259ms
: Response: Done!

- Create a tasks which will be handled by a single worker at a time

#+BEGIN_SRC sh :results output
while true; do 
  curl -X POST 127.0.0.1:8080/createWorkerTask; sleep 0.1
done
#+END_SRC

#+RESULTS:
: Task scheduled in 4.55891ms
: Response: Done!

